using System.Collections.Generic;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace ApplianceX.Server.Host.Migrations
{
    /// <inheritdoc />
    public partial class createBaseCategories : Migration
    {
        private Dictionary<string, string> collection = new Dictionary<string, string>()
        {
            { "80125", "Холодильники" },
            { "80124", "Пральні машини" },
            { "80133", "Кондиціонери" },
            { "4674675", "Комплекти вбудованої техніки" },
            { "4631242", "Акумуляторні пилососи" },
            { "81089", "Мультипічки і аерогрилі" },
            { "80153", "Соковижималки" },
            { "80161", "Прасувальні системи" },
            { "80203", "Морозильні камери" },
            { "80123", "Посудомийні машини" },
            { "80122", "Кухонні плити" },
            { "80222", "Сушильні машини" },
            { "80177", "Аксесуари до ВПТ" },
            { "4671251", "Встановлення великої побутової техніки" },
            { "4660034", "Сервісне обслуговування техніки" },
            { "80158", "Пилососи" },
            { "237815", "Роботи-пилососи" },
            { "4631249", "Пилососи для сухого прибирання" },
            { "80151", "Пароочисники" },
            { "4629564", "Швейна техніка та аксесуари" },
            { "3495687", "Машинки для стриження ковтунців" },
            { "80141", "Вбудовувані духові шафи" },
            { "80137", "Вбудовувані варильні поверхні" },
            { "80140", "Кухонні витяжки" },
            { "80162", "Вбудовувані печі НВЧ" },
            { "80134", "Подрібнювачі харчових відходів" },
            { "80185", "Аксесуари до ВПТ" },
            { "81235", "Грилі та електрошашличниці" },
            { "80155", "Блендери" },
            { "80163", "Кухонні комбайни" },
            { "112986", "Мультиварки" },
            { "80176",  "М`ясорубки" },
            { "80160", "Електрочайники" },
            { "81667", "Настільні плити" },
            { "4674316", "Світ кави" },
            { "80148", "Кухонні ваги" },
            { "4625487", "Побутові вакуумні пакувальники" },
            { "81225", " Епілятори" },
            { "252133", "Фотоепілятори" },
            { "437994", "Зубні щітки, іригатори та насадки"},
            { "81227", "Фени"},
            { "4660433", "Тримери"},
            { "81231", "Прилади для укладання волосся"},
            { "81229", "Машинки для стрижки"},
            { "81226", "Електробритви"},
            { "81232", "Ваги підлогові"},
            { "81233", "Масажери"},
            { "80186", "Вентилятори"},
            { "82795", "Водонагрівачі"},
            { "80128", "Очисники повітря"},
            { "80130", "Зволожувачі повітря"},
            { "388104", "Осушувачі повітря"},
            { "80192", "Обігрівачі"},
            { "150072", "Аксесуари до кліматичної техніки"},
            { "4648950", "Котли опалення"},
            { "4669195", "Постільна білизна з підігріванням"}
        };
        
        
        
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            foreach (var (id, title) in collection)
            {
                migrationBuilder.Sql("INSERT INTO \"ProductCategory\" (\"Title\", \"Cover\", \"CategoryUid\", \"CreatedAt\", \"UpdatedAt\") " +
                                     $"VALUES ('{title}', 'COVER', '{id}', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP)");
            }
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            foreach (var (id, title) in collection)
            {
                migrationBuilder.Sql($"DELETE FROM \"ProductCategory\" WHERE \"CategoryUid\" = '{id}'");
            }
        }
    }
    
}
